<title>segurancalaser1.html</title><h1 style="text-align: center;">Seguran&ccedil;a com Lasers</h1>
<p>&nbsp;</p>
<h2>- Brincando com lasers vindos de CD-ROM</h2>
<p>&nbsp;&nbsp;&nbsp; Vejo a maioria das pessoas que come&ccedil;am a se interessar por lasers, comprar aqueles apontadores lasers vermelhos que se compra por R$5 e come&ccedil;ar a apontar por ai. Ap&oacute;s um tempo a pessoa quer algo mais forte e procura na internet. A coisa mais comum de achar &eacute;: Laser from DVD Burner. &Eacute; de fato, acho que todos que foram procurar lasers fortes na internet j&aacute; passaram pela fase de desmontar um CD-ROM para pegar o laser (DVD &eacute; caro, CD-ROM tem uma pancada de CD-ROM velho).</p>
<p>&nbsp;&nbsp;&nbsp; Ele vai com toda empolga&ccedil;&atilde;o e remove o Diodo Laser da Unidade &Oacute;ptica, at&eacute; arranja um circuitinho na internet para ligar ele. Liga ele e se decepciona. Apenas um brilho aparentemente fraco e vermelho. Ta, esse deve estar com problema, certo?</p>
<h3 style="text-align: center;"><strong><span style="color: #ff0000;">ERRADO! JAMAIS OLHE PARA ESSE BRILHO "FRACO" VINDO DO DIODO LASER</span></strong></h3>
<p style="text-align: justify;">&nbsp;&nbsp; Voc&ecirc; n&atilde;o v&ecirc;, mas ele est&aacute; emitindo uma quantidade massiva de luz, e a maior parte das pessoas n&atilde;o sabe. Quer saber o por qu&ecirc;? Explicarei ent&atilde;o neste documento de seguran&ccedil;a.</p>
<h2 style="text-align: justify;">- Apontadores Lasers verdes e seu funcionamento.</h2>
<p style="text-align: justify;">&nbsp;&nbsp; Apontadores Laser Verdes geram a luz verde apartir de uma luz Infra-vermelha. Essa luz Infra-vermelha (que fica em 808nm) excita um cristal de um material, que gera outra luz infra-vermelha, essa em 1064nm. Ap&oacute;s isso, a luz desse cristal &eacute; jogada em outro cristal de outro material, dessa vez um dobrador de frequ&ecirc;ncia, que faz os 1064nm virarem 532nm, a nossa ent&atilde;o cor verde. Por&eacute;m um pouco de Infra-vermelho ainda sobra tanto em 808nm quanto em 1064nm ap&oacute;s a convers&atilde;o pro verde. E caso voc&ecirc; filtre a luz verde, tamb&eacute;m ver&aacute; uma luz "fraca" e vermelha vindo do diodo laser.</p>
<h2 style="text-align: justify;">- Espectro de luz visivel, e sensibilidade do olho humano.</h2>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp; T&aacute;, mas pra que voc&ecirc; falou do laser verde? Bem, se voc&ecirc;s j&aacute; viram os lasers de diversas cores, podem reparar que o verde &eacute; o unico que em relativa baixa pot&ecirc;ncia (10mW) &eacute; poss&iacute;vel ver o raio a noite, e nas demais cores, s&oacute; em pot&ecirc;ncias bem mais altas. Agora, voc&ecirc; j&aacute; parou pra pensar o porque disso? Os olhos humanos s&atilde;o capazes de enxergar cores de apenas <span style="color: #800000;">720nm</span> at&eacute; <span style="color: #800080;">380nm</span>. Reparou que os 808nm e os 1064nm est&atilde;o fora dessa faixa? Pois &eacute;, voc&ecirc; v&ecirc; apenas um teco delas por causa da pot&ecirc;ncia do diodo laser (ta vendo o perigo?), se j&aacute; n&atilde;o bastasse isso, o olho humano ainda n&atilde;o recebe por igual as cores. Dependendo do comprimento de onda da cor, ele tem uma resposta melhor ou pior da cor. Para entender melhor, imagine uma l&acirc;mpada ideal de pura cor branca. O branco &eacute; a soma de todas as cores. Por&eacute;m o teu olho ter&aacute; uma resposta diferente para cada cor que comp&otilde;e esse branco, o grafico abaixo mostra como &eacute; a resposta relativa do olho em rela&ccedil;&atilde;o ao comprimento de onda.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: center;"><img border=0 title="Curva de resposta de cores do olho humano" src="get.php@arquivo=347"  alt="Curva de resposta de cores do olho humano." width="341" height="271" /></p>
<p style="text-align: center;">Fig. 1: Curva de resposta relativa do olho humano.</p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp; Como voc&ecirc; pode ver, quanto mais saimos do laranja e irmos para o vermelho, o olho fica menos sens&iacute;vel a cor exposta, isso significa que voc&ecirc; precisar&aacute; de mais brilho na luz para que voc&ecirc; possa ve-la com a mesma intensidade (A mesma coisa para o lado do violeta).</p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp; Voc&ecirc; n&atilde;o consegue ver infra-vermelho, mas algo em sua casa pode ver. Uma c&acirc;mera de video (Seja celular ou webcam).</p>
<h2 style="text-align: justify;">- Laser de impressora laser, e seu brilho invis&iacute;vel.</h2>
<p style="text-align: justify;">&nbsp;&nbsp; Peguei um diodo laser de uma impressora laser. N&atilde;o sei qual o comprimento de onda dele, mas &eacute; infra-vermelho e ao olho n&uacute; tamb&eacute;m s&oacute; tem akele brilho "fraco". O diodo est&aacute; rodando apartir de um driver de um laser verde de 30mW (260mA). Olhe a foto tirada dele:</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: center;"><img border=0 title="Diodo Laser apontado para c&acirc;mera" src="get.php@arquivo=346"  alt="Diodo Laser apontado para c&acirc;mera" width="600" height="450" /></p>
<p style="text-align: center;">Fig. 2: Diodo Laser apontado para c&acirc;mera.</p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp; Hmm, bem mais do que voc&ecirc; v&ecirc; n&atilde;o &eacute;? &Eacute;, e bem mais forte. Mas e se eu te dizer, que sua c&acirc;mera tem <strong>filtro</strong> Infra-Vermelho na lente dela? Sim, as c&acirc;meras usam isso por que a luz infra-vermelha deteoriora a qualidade das imagens coloridas. Quer ver como seria uma foto sem o filtro infra-vermelho? Bem, peguei uma c&acirc;mera de vigil&acirc;ncia aqui, abri ela e tirei o filtro. Liguei no pc e tirei umas fotos. Vejam s&oacute;:</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: center;"><img border=0 title="Diodo Laser apontado para c&acirc;mera sem Filtro IR" src="get.php@arquivo=341"  alt="Diodo Laser apontado para c&acirc;mera sem Filtro IR" width="600" height="450" /></p>
<p style="text-align: center;">Fig. 3: Diodo Laser apontado para c&acirc;mera sem Filtro IR</p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp; Beeeeeeeem mais forte n&atilde;o? Pois &eacute;, a luz consegue passar at&eacute; atrav&eacute;s da minha m&atilde;o!</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: center;"><img border=0 title="Luz infra-vermelha atravessando minha m&atilde;o." src="get.php@arquivo=343"  alt="Luz infra-vermelha atravessando minha m&atilde;o." width="600" height="449" /></p>
<p style="text-align: center;">Fig. 4: Luz infra-vermelha atravessando minha m&atilde;o.</p>
<p style="text-align: center;">&nbsp;</p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp; Ok, mas voc&ecirc; quer algo que d&ecirc; pra ver melhor a diferen&ccedil;a? Hmm, entendo. Liguei ent&atilde;o a c&acirc;mera de vigilancia e coloquei em <em>fullscreen</em> no monitor mostrando a imagem em tempo real. E com uma maquina fotografica tirei fotos da tela do computador junto com o laser. Veja s&oacute; o resultado:</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: center;"><img border=0 title="Laser na camera com Filtro e Sem Filtro" src="get.php@arquivo=344"  alt="Laser ligado na frente da c&acirc;mera sem Filtro (Tela) e tamb&eacute;m com filtro (Foto)" width="600" height="450" /></p>
<p style="text-align: center;">Fig. 5: Mostrando na tela a imagem vinda da c&acirc;mera sem Filtro IR, e a fotografia de uma c&acirc;mera com filtro IR.</p>
<p style="text-align: center;"><img border=0 title="Laser Iluminando a mesa" src="get.php@arquivo=345"  alt="Laser Iluminando a mesa" width="600" height="450" /></p>
<p style="text-align: center;">Fig. 6: Laser Iluminando a Mesa, repare que na c&acirc;mera sem filtro a mesa est&aacute; bem iluminada, o que n&atilde;o acontece na foto.</p>
<h2 style="text-align: justify;">- Conclus&atilde;o</h2>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp; Ou seja, aquele "fraco" brilho vermelho, &eacute; na verdade uma luz BEM forte que voc&ecirc; n&atilde;o enxerga, mas que certamente iria causar s&eacute;rios danos em sua retina. Talvez um laser de menos de 5mW n&atilde;o cause dano instantaneo a sua retina, por&eacute;m n&atilde;o usar &oacute;culos de seguran&ccedil;a, pode fazer sua retina ir se deteriorando ao longo do tempo.</p>
<p style="text-align: justify;">&nbsp;&nbsp; Ent&atilde;o, n&atilde;o seja enganado pelo brilho "fraco" vermelho.</p>
<p style="text-align: justify;">&nbsp;&nbsp; S&oacute; para voc&ecirc;s verem, abaixo vai uma foto do laser de impressora laser num dissipador, rodando a apenas 10mW sem lentes.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: center;"><img border=0 title="Laser de Impressora rodando a 10mW sem lentes" src="get.php@arquivo=348"  alt="Laser de Impressora rodando a 10mW sem lentes" width="465" height="401" /></p>
<p style="text-align: center;">Fig. 7: Laser de impressora laser rodando a 10mW sem lentes</p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp; Este laser n&atilde;o faz nem se quer um brilho fraco na mesa visto atrav&eacute;s de uma c&acirc;mera comum, mas com uma c&acirc;mera sem filtro IR, ele ilumina a mesa completamente.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;">&nbsp;&nbsp; Espero que tenha dado pra entender o por que usar &oacute;culos de seguran&ccedil;a, proteja-se caso for mecher com lasers fortes assim.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;">Boa sorte!</p>
<p><a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/"><img border=0 style="border-width:0" src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" alt="Licen&ccedil;a Creative Commons" /></a><br />Esta <span>obra</span> de <a rel="cc:attributionURL" href="../ver-documento/832.html">EnergyLabs Brasil</a>, foi licenciada com uma Licen&ccedil;a <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/">Creative Commons - Atribui&ccedil;&atilde;o - Partilha nos Mesmos Termos 3.0 N&atilde;o Adaptada</a>.<br />Permiss&otilde;es adicionais ao &acirc;mbito desta licen&ccedil;a podem estar dispon&iacute;veis em <a rel="cc:morePermissions" href="../ver-documento/832.html">http://www.energylabs.com.br</a>.</p>