<title>interface.html</title><h1 style="text-align: center;"><span style="font-size: xx-large;">Interfaces para seus Projetos</span></h1>
<p>&nbsp;</p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp;&nbsp; Bom, estou fazendo esse documento para poder compartilhar algumas interfaces que uso em meus testes. Em geral s&atilde;o interfaces simples, por&eacute;m a maioria das pessoas n&atilde;o as conhece ou n&atilde;o sabe usar. Ent&atilde;o estarei aqui demonstrando as interfaces, de maneira simples por&eacute;m facil de entender. Usarei o <strong>Gerador de Fun&ccedil;&atilde;o</strong> para demonstrar o <strong>Sinal de Origem</strong>.</p>
<p style="text-align: justify;">&nbsp;</p>
<h2 style="text-align: justify;">- Interfaces para Alto Falante (Interface de &Aacute;udio)</h2>
<p>&nbsp;</p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp;&nbsp; Essas interfaces s&atilde;o para aqueles que criam projetos com microprocessadores, FPGA's ou outros e querem ligar um alto falante mas n&atilde;o sabem um jeito seguro. O jeito mais simples &eacute; apenas um resistor em s&eacute;rie, como demonstrado abaixo:</p>
<h3>- Interface Simples</h3>
<p style="text-align: center;"><a href="get.php@arquivo=826" target="_blank"><img border=0 title="Interface de &Aacute;udio Simples" src="get.php@arquivo=826"  alt="Interface de &Aacute;udio Simples para uC" width="500" height="298" /></a></p>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp;&nbsp; Repare que h&aacute; um segundo circuito com um capacitor em s&eacute;rie. Isso evita que flua corrente continua no alto falante, protegendo tanto o alto falante quanto a interface.</p>
<h3 style="text-align: justify;">- Interface com Ponte BJT (Totem Pole)</h3>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp;&nbsp; Esta interface &eacute; para haver um isolamento um pouco maior do CI, mas ainda fluindo uma corrente significativa. No caso do circuito, caso o sinal de entrada seja 5V, a corrente ser&aacute; 6mA. Por&eacute;m no alto falante ir&aacute; haver uma potencia de 20mW para 8Ohms.</p>
<p>&nbsp;</p>
<p style="text-align: center;"><a href="get.php@arquivo=827" target="_blank"><img border=0 title="Interface em Totem Pole para Alto Falante" src="get.php@arquivo=827"  alt="Interface em Totem Pole para Alto Falante" width="500" height="230" /></a></p>
<h3 style="text-align: justify;">- Interface com Ponte de Mosfet (Half Bridge de Mosfet)</h3>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp;&nbsp; Esta &eacute; uma interface mais complexa, mas que oferece um rendimento maior e tamb&eacute;m uma pot&ecirc;ncia maior. Usando dois mosfets complementares pode gerar at&eacute; 1W de potencia para 8 Ohms. A maior vantagem dele &eacute; a velocidade de chaveamento dos mosfets, que &eacute; bem alta. A desvantagem &eacute; que &eacute; necess&aacute;rio pelo menos um sinal de 10V para chavear os mosfets.</p>
<p>&nbsp;</p>
<p style="text-align: center;"><a href="get.php@arquivo=828"><img border=0 title="Interface com Meia ponte de Mosfet" src="get.php@arquivo=828"  alt="Interface com Ponte de Mosfets" width="500" height="265" /></a></p>
<p style="text-align: center;">&nbsp;</p>
<h2 style="text-align: justify;">- Voltage Level Shifter ( Tradutor de Sinais )</h2>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp;&nbsp; Como voc&ecirc;s podem reparar no ultimo esquema, &eacute; necess&aacute;rio pelo menos 10V para conseguir chavear os mosfets. Por&eacute;m a maioria dos CI's tem interface 5V ou at&eacute; menos. Como solucionar o problema? Simples! Basta usar um <strong>Level Shifter</strong>. O <strong>Level Shifter</strong> &eacute; um Tradutor de Tens&atilde;o de Sinais, no circuito abaixo, usamos um Buffer com Sa&iacute;da <strong>Open-Collector</strong> de Relativa Alta Tens&atilde;o ( 30V Maximos ). Esta interface &eacute; rapida e eficaz.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: center;"><a href="get.php@arquivo=830" target="_blank"><img border=0 title="Level Shifter (Tradutor de Sinais) com 74HC07" src="get.php@arquivo=830"  alt="Level Shifter com 74HC07" width="500" height="429" /></a></p>
<p style="text-align: center;">&nbsp;</p>
<h2 style="text-align: justify;">- Interface de Isolamento com Opto-Acoplador</h2>
<p style="text-align: justify;">&nbsp;&nbsp;&nbsp;&nbsp; As vezes &eacute; necess&aacute;rio um isolamento galv&acirc;nico (isolamento f&iacute;sico) de sinais el&eacute;tricos por seguran&ccedil;a. Neste caso podemos usar um <strong>Opto-Acoplador</strong> que &eacute; um CI com um Led e um Trans&iacute;stor Interno, fazendo uma interface &Oacute;ptica de Sinais. No esquema abaixo h&aacute; como usa-lo em um circuito gen&eacute;rico, note que o 74HC14 &eacute; um Schmitt Trigger, e serve para corrigir o sinal em <strong>Onda Quadrada</strong> na sa&iacute;da.</p>
<p><a href="get.php@arquivo=831" target="_blank"></a></p>
<p style="text-align: center;"><img border=0 title="Interface de Isolamento G&acirc;lvanico com Opto-Acoplador" src="get.php@arquivo=831"  alt="Interface de Isolamento Galv&acirc;nico com Opto-Acoplador" width="500" height="151" /></p>
<h2 style="text-align: justify;">- Interface de Pot&ecirc;ncia com Half-Bridge de Mosfets</h2>
<p style="text-align: justify;">&nbsp;&nbsp; Pode parecer que eu j&aacute; passei esse esquema, por&eacute;m este daqui &eacute; apenas para sinais quadrados. Essa topologia de chaveamento &eacute; bem eficaz e funciona muito bem. &Eacute; usada atualmente para Inversores, Bobinas de Tesla, Amplificadores Classe D, entre outros. &Eacute; uma interface um pouco complexa, mas facil de montar. O <strong>GDT </strong>&eacute; um transformador enrolado em n&uacute;cleo de p&oacute; de ferro, e o numero de voltas depender&aacute; da frequ&ecirc;ncia de trabalho. No geral pra uso em Bobinas de Tesla, a frequ&ecirc;ncia fica em torno de 100 a 400 kHz, o que faz 10 voltas para cada enrolamento suficiente. O <strong>1:1:1</strong> em baixo dele, &eacute; a rela&ccedil;&atilde;o de voltas entre <strong>Primario:Secund&aacute;rio:Secund&aacute;rio</strong>.</p>
<p>&nbsp;</p>
<p style="text-align: center;"><a href="get.php@arquivo=825" target="_blank"><img border=0 title="Interface de Alta Pot&ecirc;ncia com Half-Bridge de Mosfets" src="get.php@arquivo=825"  alt="Interface de Alta Pot&ecirc;ncia com Half-Bridge de Mosfets" width="500" height="349" /></a></p>
<p style="text-align: center;">&nbsp;</p>
<h2 style="text-align: justify;">- Resumo</h2>
<p style="text-align: justify;">&nbsp;&nbsp; Aqui passei umas interfaces, a maioria de montagem simples, mas que s&atilde;o muito &uacute;teis no dia a dia de quem faz projetos. Espero que essas interfaces ajudem a todos que queiram mecher com eletr&ocirc;nica.</p>
<p style="text-align: justify;">&nbsp;&nbsp; Qualquer d&uacute;vida, me contatem!</p>
<p><a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/"><img border=0 style="border-width:0" src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" alt="Licen&ccedil;a Creative Commons" /></a><br />Esta <span>obra</span> de <a rel="cc:attributionURL" href="../ver-documento/832.html">EnergyLabs Brasil</a>, foi licenciada com uma Licen&ccedil;a <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/">Creative Commons - Atribui&ccedil;&atilde;o - Partilha nos Mesmos Termos 3.0 N&atilde;o Adaptada</a>.<br />Permiss&otilde;es adicionais ao &acirc;mbito desta licen&ccedil;a podem estar dispon&iacute;veis em <a rel="cc:morePermissions" href="../ver-documento/832.html">http://www.energylabs.com.br</a>.</p>